micropython/micropython/ports/esp32/boards/WPI_PICO_W/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Walnut Pi Pico W"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "WPI_PICO_W"

#define MICROPY_PY_MACHINE_DAC              (0)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)
